InformationRegisters/ЗадачиБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиБухгалтера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешЗадачи</Name>
					<Comment>Рассчитывается по хеш-функции MD5</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетаЕНС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУстановленВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательУстановившийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПравилоЗадачиБухгалтера</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийКалендаряБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ВыполнениеЗадачБухгалтераКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьКомандуСпискаЗадачМобильныйКлиент(ПараметрыКоманды) Экспорт
	
	ВыполнениеЗадачБухгалтераКлиентПереопределяемый.ПриВыполненииКомандыСпискаЗадачМобильныйКлиент(ПараметрыКоманды);
	
КонецПроцедуры

Процедура ВыполнитьДействиеОткрытьФорму(ОписаниеДействия, ВладелецФормы, ОписаниеОповещенияОЗакрытии) Экспорт
	
	ПараметрыФормы = ОписаниеДействия.ПараметрыФормы;
	Если ОписаниеДействия.Свойство("ИдентификаторФормы") Тогда
		ИдентификаторФормы = ОписаниеДействия.ИдентификаторФормы;
	ИначеЕсли ТипЗнч(ПараметрыФормы) = Тип("Структура") И ПараметрыФормы.Свойство("Ключ") Тогда
		ИдентификаторФормы = ПараметрыФормы.Ключ;
	Иначе
		ИдентификаторФормы = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// Если открываемая форма - это регламентированный отчет,
	// то в этом случае для открытия нужно использовать специальный программный интерфейс БРО.
	Если ОписаниеДействия.Свойство("ОткрытьРегламентированныйОтчет")
		И ОписаниеДействия.ОткрытьРегламентированныйОтчет = Истина Тогда
		ИнтерфейсыВзаимодействияБРОКлиент.ОткрытьФормуРегламентированногоОтчета(
			ОписаниеДействия.ИмяФормы,
			ОписаниеДействия.ПараметрыФормы,
			ВладелецФормы,
			ИдентификаторФормы,
			,
			,
			ОписаниеОповещенияОЗакрытии);
	Иначе
		ОткрытьФорму(
			ОписаниеДействия.ИмяФормы,
			ОписаниеДействия.ПараметрыФормы,
			ВладелецФормы,
			ИдентификаторФормы,
			,
			,
			ОписаниеОповещенияОЗакрытии);
	КонецЕсли;
	
	ЗарегистрироватьВЖурналеОткрытиеФормы(ОписаниеДействия.ИмяФормы);
	
КонецПроцедуры

Процедура ВыполнитьДействие(ОписаниеДействия) Экспорт
	
	Если ОписаниеДействия.Свойство("ИмяФормы") Тогда
		
		ВыполнитьДействиеОткрытьФорму(ОписаниеДействия, Неопределено, Неопределено);
		
	ИначеЕсли ОписаниеДействия.Свойство("Предупреждение") Тогда
		
		ПоказатьПредупреждение( , ОписаниеДействия.Предупреждение);
		ВыполнениеЗадачБухгалтераВызовСервера.ЗарегистрироватьВЖурналеПоказПредупреждения(ОписаниеДействия.Предупреждение);
		
	ИначеЕсли ОписаниеДействия.Свойство("Вопрос") Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект, ОписаниеДействия);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Да",  ОписаниеДействия.ВариантДа);
		Кнопки.Добавить("Нет", ОписаниеДействия.ВариантНет);
		Кнопки.Добавить("Отмена");
		ПоказатьВопрос(Оповещение, ОписаниеДействия.Вопрос, Кнопки, , "Да");
		
	ИначеЕсли ОписаниеДействия.Свойство("Подключение1СОтчетности") Тогда
		
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ПоказатьФормуПредложениеОформитьЗаявлениеНаПодключение(
			ОписаниеДействия.Организация);
		ЗарегистрироватьВЖурналеОткрытиеФормы("Подключение1СОтчетности");
		
	ИначеЕсли ОписаниеДействия.Свойство("Подключение1СЭДО") Тогда
		
		ВыполнениеЗадачБухгалтераКлиентПереопределяемый.ВыполнитьДействиеПодключение1СЭДО(ОписаниеДействия);
		
	ИначеЕсли ОписаниеДействия.Свойство("ФинОтчетность") Тогда
		
		ВыполнениеЗадачБухгалтераКлиентПереопределяемый.ВыполнитьДействиеФинОтчетность(ОписаниеДействия);
		
	ИначеЕсли ОписаниеДействия.Свойство("Переход") Тогда
		
		ПерейтиПоНавигационнойСсылке(ОписаниеДействия.Переход);
		ВыполнениеЗадачБухгалтераВызовСервера.ЗарегистрироватьВЖурналеПереходПоСсылке(ОписаниеДействия.Переход);
		
	КонецЕсли;

КонецПроцедуры

Процедура ВопросЗавершение(Ответ, ОписаниеДействия) Экспорт
	
	ВладелецФормы = Неопределено;
	ОписаниеОповещенияОЗакрытии = Неопределено;
	
	Если Ответ = "Да" Тогда
		ВыполнитьДействиеОткрытьФорму(ОписаниеДействия.ДействиеДа, ВладелецФормы, ОписаниеОповещенияОЗакрытии);
	ИначеЕсли Ответ = "Нет" Тогда
		ВыполнитьДействиеОткрытьФорму(ОписаниеДействия.ДействиеНет, ВладелецФормы, ОписаниеОповещенияОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

// Помечает задачу как выполненную
//
// Параметры:
//  ПараметрыКоманды - Структура - см. ВыполнениеЗадачБухгалтераКлиентСервер.НовыеПараметрыКомандЗадачи(),
//                     для регулярных платежей дополнительно содержит элемент с ключом "Оплачено"
//
Процедура ОтметитьЗадачуКакВыполненную(ПараметрыКоманды, Форма) Экспорт
	
	ТекстВопроса = "";
	ЗадатьВопрос = Ложь;
	ВыполнениеЗадачБухгалтераКлиентПереопределяемый.ПроверитьОтметитьЗадачуКакВыполненную(ПараметрыКоманды, Форма, ТекстВопроса, ЗадатьВопрос);
	Если ЗадатьВопрос Тогда
		
		//Дополнительно спросим убрать ли все напоминания об этом платеже.
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыКоманды", ПараметрыКоманды);
		ДополнительныеПараметры.Вставить("Форма",            Форма);
		
		Оповещение = Новый ОписаниеОповещения("ВопросПродолжатьНапоминатьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		ЗавершитьЗадачу(ПараметрыКоманды, Форма);
	КонецЕсли;
	
КонецПроцедуры

// Записывает в журнал регистрации факт открытия формы.
//
Процедура ЗарегистрироватьВЖурналеОткрытиеФормы(ИмяФормы) Экспорт

	Если СтрНайти(ВРег(ИмяФормы), ВРег("ПомощникУплатыНалога")) > 0 Тогда
		// Открытие самой формы помощника не регистрируем, 
		// интересует открытие отчета из помощника.
		Возврат;
	КонецЕсли;

	ВыполнениеЗадачБухгалтераВызовСервера.ЗарегистрироватьВЖурналеОткрытиеФормы(ИмяФормы);

КонецПроцедуры

// Выполняет расшифровку транспортных сообщений - требований ФНС.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации
//
Процедура РасшифроватьСообщения(Организация) Экспорт
	
	НеРасшифровывать = Ложь;
	ВыполнениеЗадачБухгалтераКлиентПереопределяемый.ПроверитьРасшифроватьСообщения(Организация, НеРасшифровывать);
	Если НеРасшифровывать Тогда
		Возврат;
	КонецЕсли;
	Если Не ДокументооборотСКОВызовСервера.ТекущемуПользователюЭДОДоступен() Тогда
		ПоказатьПредупреждение(, НСтр("ru='У пользователя недостаточно прав для расшифровки требования.
			|Обратитесь к администратору для получения доступа.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьРасшифровкуСообщений", ЭтотОбъект, Организация);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВопросПродолжатьНапоминатьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	// Завершаем задачу только после ответа на вопрос,
	// чтобы было понятно о какой задаче продолжать или не продолжать напоминать.
	ЗавершитьЗадачу(ДополнительныеПараметры.ПараметрыКоманды, ДополнительныеПараметры.Форма);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ПрекратитьВыполнение(ДополнительныеПараметры.ПараметрыКоманды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьЗадачу(ПараметрыКоманды, Форма)
	
	КлючЗаписи = ВыполнениеЗадачБухгалтераВызовСервера.ПеренестиВАрхив(ПараметрыКоманды);
	
	Если ТипЗнч(КлючЗаписи) = Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера") 
		Или ВыполнениеЗадачБухгалтераКлиентСервер.ЭтоДокументСЭДО(ПараметрыКоманды.Правило) Тогда
		
		ТипПравила = ТипЗнч(ПараметрыКоманды.Правило);
		
		Если ТипПравила = Тип("СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов") Тогда
			
			ПоказатьОповещениеПользователя(
				, // Без заголовка
				"e1cib/app/РегистрСведений.ЗадачиБухгалтера.Форма.ЗадачиВАрхиве",
				НСтр("ru = 'Задача помещена в архив'"));
			
		КонецЕсли;
		
		ОповеститьОбИзменении(КлючЗаписи);
		Оповестить("СписокЗадачБухгалтера_Изменение");
		
	КонецЕсли;
	
	Если ПоказыватьНовости(Форма) Тогда
		ИдентификаторыСобытий = "ПриОтметкеЗадачиКакВыполненной";
		ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриПроизвольномСобытии(
			Форма,
			ИдентификаторыСобытий);
	ИначеЕсли Форма.Элементы.Найти("Результат") <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Форма.Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

Функция ПоказыватьНовости(Форма)
	
	Если СтрНайти(Форма.ИмяФормы, "ПлатежныйКалендарь") = 0 Тогда // В Платежный календарь новости не встроены
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Новости");
	
КонецФункции

Процедура ПрекратитьВыполнение(ПараметрыКоманды)
	
	Организация = ПараметрыКоманды.Организация;
	Правило     = ПараметрыКоманды.Правило;
	
	Если ВыполнениеЗадачБухгалтераВызовСервера.ПрекратитьВыполнение(Организация, Правило) Тогда
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера"));
		Оповестить("СписокЗадачБухгалтера_Изменение");
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьРасшифровкуСообщений(Результат, Организация) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
	ВходящиеСообщения = КонтекстЭДОКлиент.ПолучитьИОбработатьВходящие(Новый УникальныйИдентификатор);
	ТребующиеРасшифровки = ВходящиеСообщения.ТребующиеРасшифровки;
	
	СтруктураСообщений = Новый Структура;
	СтруктураСообщений.Вставить("Организация",         Организация);
	СтруктураСообщений.Вставить("КоличествоСообщений", ТребующиеРасшифровки.Количество());
	СтруктураСообщений.Вставить("Сообщения",           Новый ФиксированныйМассив(ТребующиеРасшифровки));
	ИтогиПоСообщениям = Новый Массив;
	ИтогиПоСообщениям.Добавить(СтруктураСообщений);
	
	Результат = КонтекстЭДОКлиент.СобратьСообщенияДляРасшифровкиНаКлиенте(ИтогиПоСообщениям);
	ВходящийКонтекст = Новый Структура;
	ПараметрыПоказа = КонтекстЭДОКлиент.ПараметрыПоказаСообщенийТребующихРасшифровки();
	ВходящийКонтекст.Вставить("ПараметрыПоказа", ПараметрыПоказа);
	КонтекстЭДОКлиент.НачатьДлительнуюОперациюПоРасшифровкеСообщений(Результат, ВходящийКонтекст);
	
КонецПроцедуры

#КонецОбласти
